## Staging: alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.wordpress_canary will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "wordpress_canary"  {
      ~ id                  = "d0b66c20b04aa9a733b2f1267dd66f406954a8f5" -> (known after apply)
      ~ output_base64sha256 = "k+/LIBG/WMT+GvApoDAyK6twOLz3jOIwwaXyxoZrd0c=" -> (known after apply)
      ~ output_md5          = "77510c8eb97238cfe30d69a6bd4ef0c6" -> (known after apply)
      ~ output_path         = "d5412999-05ff-4d7a-8ddc-c939119326e4-canary.js.zip" -> (known after apply)
      ~ output_sha          = "d0b66c20b04aa9a733b2f1267dd66f406954a8f5" -> (known after apply)
      ~ output_size         = 1037 -> (known after apply)
        # (1 unchanged attribute hidden)

      - source {
          - content  = <<-EOT
                "use strict";
                
                const { URL } = require("url");
                const synthetics = require("Synthetics");
                const log = require("SyntheticsLogger");
                const syntheticsConfiguration = synthetics.getConfiguration();
                
                /**
                 * Main handler for the healthcheck canary.  Loops over the `const urls` 
                 * and attempts to load the given page in Puppeteer.  Any HTTP resonse
                 * code outside of the 200 range is considered a failure.
                 */
                const handler = async function () {
                
                    syntheticsConfiguration.disableStepScreenshots();
                    syntheticsConfiguration.setConfig({
                       continueOnStepFailure: true
                    });
                 
                    let page = await synthetics.getPage();
                    
                    for (const url of urls) {
                        await executeStep(page, url);
                    }
                };
                
                /**
                 * Parses the given url and executes the canary step.
                 * @param {Object} page Puppeteer page object
                 * @param {String} url URL to load
                 */
                const executeStep = async function (page, url) {
                    let stepName = null;
                 
                    try {
                        stepName = new URL(url).hostname;
                    } catch (error) {
                        log.error(`Error parsing url: ${url}.  ${error}`);
                        throw error;
                    }
                    
                    await synthetics.executeStep(stepName, async function () {
                        await gotoUrl(page, url);
                    });
                };
                
                /**
                 * Attempts to load the given URL.  HTTP response code must be in the 200 range
                 * to be considered a success.
                 * @param {Object} page Puppeteer page object 
                 * @param {String} url URL to load
                 */
                const gotoUrl = async function (page, url) {
                    const response = await page.goto(url, { waitUntil: ["domcontentloaded"], timeout: 30000});
                    if (response) {
                        const status = response.status();
                        const statusText = response.statusText(); 
                        if (status < 200 || status > 299) {
                            throw new Error(`Failed to load url: ${url} ${status} ${statusText}`); 
                        }
                    } else {
                        const logNoResponseString = `No response returned for url: ${url}`;
                        log.error(logNoResponseString);
                        throw new Error(logNoResponseString);
                    }
                }
                
                const urls = [
                    "https://articles.cdssandbox.xyz/", 
                    "https://articles.cdssandbox.xyz/"
                ];
                 
                exports.handler = async () => {
                    return await handler();
                };
                exports.executeStep = executeStep;
                exports.gotoUrl = gotoUrl;
            EOT -> null
          - filename = "nodejs/node_modules/healthcheck.js" -> null
        }
      + source {
          + content  = <<-EOT
                "use strict";
                
                const { URL } = require("url");
                const synthetics = require("Synthetics");
                const log = require("SyntheticsLogger");
                const syntheticsConfiguration = synthetics.getConfiguration();
                
                /**
                 * Main handler for the healthcheck canary.  Loops over the `const urls` 
                 * and attempts to load the given page in Puppeteer.  Any HTTP resonse
                 * code outside of the 200 range is considered a failure.
                 */
                const handler = async function () {
                
                    syntheticsConfiguration.disableStepScreenshots();
                    syntheticsConfiguration.setConfig({
                       continueOnStepFailure: true
                    });
                 
                    let page = await synthetics.getPage();
                    
                    for (const url of urls) {
                        await executeStep(page, url);
                    }
                };
                
                /**
                 * Parses the given url and executes the canary step.
                 * @param {Object} page Puppeteer page object
                 * @param {String} url URL to load
                 */
                const executeStep = async function (page, url) {
                    let stepName = null;
                 
                    try {
                        stepName = new URL(url).hostname;
                    } catch (error) {
                        log.error(`Error parsing url: ${url}.  ${error}`);
                        throw error;
                    }
                    
                    await synthetics.executeStep(stepName, async function () {
                        await gotoUrl(page, url);
                    });
                };
                
                /**
                 * Attempts to load the given URL.  HTTP response code must be in the 200 range
                 * to be considered a success.
                 * @param {Object} page Puppeteer page object 
                 * @param {String} url URL to load
                 */
                const gotoUrl = async function (page, url) {
                    const response = await page.goto(url, { waitUntil: ["domcontentloaded"], timeout: 30000});
                    if (response) {
                        const status = response.status();
                        const statusText = response.statusText(); 
                        if (status < 200 || status > 299) {
                            throw new Error(`Failed to load url: ${url} ${status} ${statusText}`); 
                        }
                    } else {
                        const logNoResponseString = `No response returned for url: ${url}`;
                        log.error(logNoResponseString);
                        throw new Error(logNoResponseString);
                    }
                }
                
                const urls = [
                    "https://articles.cdssandbox.xyz/sign-in-se-connecter/", 
                    "https://articles.cdssandbox.xyz/fr/sign-in-se-connecter/"
                ];
                 
                exports.handler = async () => {
                    return await handler();
                };
                exports.executeStep = executeStep;
                exports.gotoUrl = gotoUrl;
            EOT
          + filename = "nodejs/node_modules/healthcheck.js"
        }
    }

  # data.aws_iam_policy_document.synthetic_canary_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "synthetic_canary_policy"  {
      ~ id      = "2363901986" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::platform-mvp-synthetic-canary-staging/*",
                          - "arn:aws:s3:::platform-mvp-synthetic-canary-staging",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:729164266357:log-group:/aws/lambda/cwsyn-wordpress-healthcheck-*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "s3:ListAllMyBuckets",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action    = "cloudwatch:PutMetricData"
                      - Condition = {
                          - StringEquals = {
                              - cloudwatch:namespace = "CloudWatchSynthetics"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # aws_iam_policy.synthetic_canary_policy will be updated in-place
  ~ resource "aws_iam_policy" "synthetic_canary_policy" {
        id        = "arn:aws:iam::729164266357:policy/SyntheticCanaryPolicy"
        name      = "SyntheticCanaryPolicy"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::platform-mvp-synthetic-canary-staging/*",
                          - "arn:aws:s3:::platform-mvp-synthetic-canary-staging",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:729164266357:log-group:/aws/lambda/cwsyn-wordpress-healthcheck-*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "s3:ListAllMyBuckets",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action    = "cloudwatch:PutMetricData"
                      - Condition = {
                          - StringEquals = {
                              - cloudwatch:namespace = [
                                  - "CloudWatchSynthetics",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_synthetics_canary.wordpress will be updated in-place
  ~ resource "aws_synthetics_canary" "wordpress" {
        id                       = "wordpress-healthcheck"
        name                     = "wordpress-healthcheck"
        tags                     = {}
      ~ zip_file                 = "d5412999-05ff-4d7a-8ddc-c939119326e4-canary.js.zip" -> (known after apply)
        # (13 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # random_uuid.wordpress_canary must be replaced
-/+ resource "random_uuid" "wordpress_canary" {
      ~ id      = "d5412999-05ff-4d7a-8ddc-c939119326e4" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "template" = "44b205aa1ecd667147bb314034e64f49427643d0c5188f09fe1857f42e08eda8" -> "5bc8d532fdae28b7a45750677b7b327436adbdb0817322180a174921b8523854"
        }
      ~ result  = "d5412999-05ff-4d7a-8ddc-c939119326e4" -> (known after apply)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>